import vk_api
import random
import time
import traceback
import random

print('Разработано разработчиком MaxyuOff. На дошик (qiwi ник): RUTHENIUM. Среди моих проектов - бот вк Сахар - https://vk.com/caxap_media_off')

print('Введи свой токен:')
token = input()

print('Введи ссылку на нужный пост для просьбы:')
post = input()

session = vk_api.VkApi(token = token)
aa = session._auth_token()

texts = ['Здравствуйте! Можно роспись прошу?', 'Слушайте... а можно мне роспись пожалуйста? Вот сюда:', 'Кх-кхе,  а можно роспись немножка..?', 'Я хочу быть крутым... Распишитесь прошу((']
groups = ['-25228956','-11445015', '-37131732', '-131951692', '-84566848', '-42370413', '-107755353', '-73075387', '-10693037', '-18479452', '-12698764', '-22522055', '-33385322', '-9159189', '-26421686', '-1239834', '-18970929', '-147971379', '-29727543', '-53736046', '-43618728', '-67937894', '-44345402', '-19232159', '-35691604', '-28490858', '-10846501', '-21579301', '-73869447', '-21148887', '-74038144', '-11204681', '-97568466', '-21179173', '-141346856', '-125454', '-9071615', '-55173999', '-98648430', '-39135328', '-33340946' '-3584835', '-72785966', '-43747985', '-21563141', '-52298374', '-48427976', '-85171267', '-53644646', '-15106510', '-48864', '-17479367', '-134941639' '-29042319', '-54814053', '-63575', '-90634038', '-55553348', '-13842325', '-11664745', '-37435783', '-35946202', '-94725737', '-69606242', '-167177027', '205597048', '-']

def send_message(user_id, message):
    session.method("messages.send",{
        "user_id": user_id,
        "message": message,
        "random_id": random.randint(0, 100000)
        })

i = 0

while True:    
   try:
      groupsLen = len(groups)
      g = groupsLen - 1
      while i != g:
         choice = random.choice(texts)
         send_message(groups[i], choice + ' ' + post)
         print('message sent')
         time.sleep(5)
         if i%2 == 0:
            print('mini-pause started')
            time.sleep(10)
            print('the mini-pause is over')
         i+= 1
   except:
      i+= 1
      sleep(15)
